wwhRyan/GD32-F30x/BoardApp/LcosBoard/at.c
/**
 * @file at.c
 * @author Wu Wenhao (whwu@appotronics.com)
 * @brief
 * @version 1.02
 * @date 2022-02-15
 *
 * @copyright Copyright@appotronics 2022. All Rights Reserved
 *
 */
#include "AtCmdHashTable.h"
#include "AtKeyHashTable.h"
#include "AtProtocol.h"
#include "BoardInit.h"
#include "basicApp.h"
#include "eeprom.h"
#include "gd32f30x_gpio.h"
#include "rti_vc_api.h"
#include "ulog.h"
#include "utils.h"
#include "utilsAsciiConvert.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

extern asAtProtocol at_obj;
extern const mem_t eeprom_mem[];
extern temperature_t temperature[];
extern file_t eeprom_log;

IAtOperationRegister(kCmdSystem, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        switch (my_kvs[0].value) {
        case kKeyOn:
            if (power_resume() == true) {
                set_sig(sys_sig, sig_lightsource, true);
                set_sig(sys_sig, sig_system, true);
                gpio_bit_set(MCU_GPIO_INT_PORT, MCU_GPIO_INT_PIN);
                IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");

            } else {
                set_sig(sys_sig, sig_lightsource, false);
                set_sig(sys_sig, sig_system, false);
                IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
                EXCUTE_ONCE(ULOG_ERROR("error to power on"));
            }
            break;

        case kKeyIdle:
            if (gpio_output_bit_get(SYS_12V_ON_PORT, SYS_12V_ON_PIN)) {
                clear_sig(sys_sig, sig_lightsource);
                clear_sig(sys_sig, sig_system);
                clear_sig(sys_sig, sig_update_rdc200a);
                clear_sig(sys_sig, sig_update_firmware);
                IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
            } else {
                IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
            }
            break;

        case kKeyOff:
            ULOG_DEBUG("system off\n");
            laser_off();
            clear_sig(sys_sig, sig_lightsource);
            clear_sig(sys_sig, sig_system);
            clear_sig(sys_sig, sig_update_rdc200a);
            clear_sig(sys_sig, sig_update_firmware);
            clear_sig(sys_sig, sig_slient_async_msg);
            clear_sig(sys_sig, sig_rdc200a_status);
            ULOG_DEBUG("sig_lightsource off\n");
            gpio_bit_reset(MCU_GPIO_INT_PORT, MCU_GPIO_INT_PIN);
            gpio_bit_reset(SYS_12V_ON_PORT, SYS_12V_ON_PIN);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
            break;

        default:
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
            return;
        }
    } else {
        if (kKeyStatus == my_kvs[0].key) {
            if (gpio_output_bit_get(SYS_12V_ON_PORT, SYS_12V_ON_PIN)) {
                if (get_sig(sys_sig, sig_system))
                    IAddFeedbackStrTo(pAt_feedback_str, "Status:On\n");
                else
                    IAddFeedbackStrTo(pAt_feedback_str, "Status:Idle\n");
            } else {
                IAddFeedbackStrTo(pAt_feedback_str, "Status:Off\n");
            }
        } else
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    }
}

// TODO: add display off and add dispaly on
IAtOperationRegister(kCmdLightSource, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyOn == my_kvs[0].value) {
            set_sig(sys_sig, sig_lightsource, true);
            ULOG_DEBUG("sig_lightsource on\n");
            if (get_sig(sys_sig, sig_rdc200a_status))
                IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
            else
                IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n"); // rdc200a must work normal with MIPI input
        } else if (kKeyOff == my_kvs[0].value) {
            clear_sig(sys_sig, sig_lightsource);
            ULOG_DEBUG("sig_lightsource off\n");
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    } else {
        if (kKeyStatus == my_kvs[0].key) {
            if (gpio_output_bit_get(LD_EN_H_PORT, LD_EN_H_PIN)) {
                IAddFeedbackStrTo(pAt_feedback_str, "Status:On\n");
            } else {
                IAddFeedbackStrTo(pAt_feedback_str, "Status:Off\n");
            }
        } else
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    }
}

IAtOperationRegister(kCmdVersion, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    char str_buff[32] = { 0 };
    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        ULOG_DEBUG("no support setting!\n");
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyMcu:
                ULOG_DEBUG("kKeyMcu\n");
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n", pAt_Kv_List->pList[i].key.pData, MCU_VERSION);
                break;
            case kKeyLightEngineBoard:
                ULOG_DEBUG("kKeyLightEngineBoard\n");
                IAddKeyValueStrTo(pAt_feedback_str, "%s:V%01X.%01X\n", pAt_Kv_List->pList[i].key.pData,
                    gpio_output_bit_get(HW_VER1_PORT, HW_VER1_PIN), gpio_output_bit_get(HW_VER0_PORT, HW_VER0_PIN));
                break;

            case kKeyRdc200a:
                ULOG_DEBUG("kKeyRdc200a\n");
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n", pAt_Kv_List->pList[i].key.pData, get_rdc200a_version(str_buff, sizeof(str_buff)));
                break;

            case kKeyRdp250h:
                ULOG_DEBUG("kKeyRdp250h\n");
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n", pAt_Kv_List->pList[i].key.pData, get_rdp250h_version(str_buff, sizeof(str_buff)));
                break;

            case kKeyEeprom:
                ULOG_DEBUG("kKeyEeprom\n");
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n", pAt_Kv_List->pList[i].key.pData, get_eeprom_version(str_buff, sizeof(str_buff)));
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
    }
    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
}

IAtOperationRegister(kCmdSn, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    char str_buff[32] = { 0 };

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        // IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyLightEngine:
                strncpy(eeprom.Sn_LightEngine, my_kvs[i].value, 32);
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_Sn_LightEngine], true);
                break;
            case kKeySourceLight:
                strncpy(eeprom.Sn_SourceLight, my_kvs[i].value, 32);
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_Sn_SourceLight], true);
                break;
            case kKeyProjector:
                strncpy(eeprom.Sn_Projector, my_kvs[i].value, 32);
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_Sn_Projector], true);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
        IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyLightEngine:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n",
                    pAt_Kv_List->pList[i].key.pData, get_sn(0, str_buff));
                break;
            case kKeySourceLight:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n",
                    pAt_Kv_List->pList[i].key.pData, get_sn(1, str_buff));
                break;
            case kKeyProjector:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%s\n",
                    pAt_Kv_List->pList[i].key.pData, get_sn(2, str_buff));
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
    }
}

IAtOperationRegister(kCmdLightSourceTime, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        ULOG_DEBUG("no support setting!\n");
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyHour:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n", pAt_Kv_List->pList[i].key.pData, eeprom.light_source_time / 60 / 60);
                break;
            case kKeyMinute:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n", pAt_Kv_List->pList[i].key.pData, eeprom.light_source_time / 60 % 60);
                break;
            case kKeySecond:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n", pAt_Kv_List->pList[i].key.pData, eeprom.light_source_time % 60);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
    }
}

IAtOperationRegister(kCmdInstallationMode, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyCeilingFront == my_kvs[0].value) {
            h_v_flip_set(v_0_h_0);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyCeilingRear == my_kvs[0].value) {
            h_v_flip_set(v_0_h_1);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyTableFront == my_kvs[0].value) {
            h_v_flip_set(v_1_h_0);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyTableRear == my_kvs[0].value) {
            h_v_flip_set(v_1_h_1);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
            return;
        }
    } else {
        flip_t tmp = h_v_flip_get();
        switch (tmp) {
        case v_0_h_0:
            IAddFeedbackStrTo(pAt_feedback_str, "Status:CeilingFront\n");
            break;
        case v_0_h_1:
            IAddFeedbackStrTo(pAt_feedback_str, "Status:CeilingRear\n");
            break;
        case v_1_h_0:
            IAddFeedbackStrTo(pAt_feedback_str, "Status:TableFront\n");
            break;
        case v_1_h_1:
            IAddFeedbackStrTo(pAt_feedback_str, "Status:TableRear\n");
            break;
        default:
            IAddFeedbackStrTo(pAt_feedback_str, "Status:InvalidKey\n");
            return;
        }
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
    }
}

IAtOperationRegister(kCmdTestPattern, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyOff != my_kvs[0].value) {
            switch (my_kvs[0].value) {
            case kKeyRed:
                Border(255, 0, 0);
                break;

            case kKeyGreen:
                Border(0, 255, 0);
                break;

