wwhRyan/GD32-F30x/BoardApp/LcosBoard/at.c
            case kKeyBlue:
                Border(0, 0, 255);
                break;

            case kKeyGrey:
                Border(128, 128, 128);
                break;

            case kKeyMagenta:
                Border(255, 0, 255);
                break;

            case kKeyCyan:
                Border(0, 255, 255);
                break;

            case kKeyYellow:
                Border(255, 255, 0);
                break;

            case kKeyBlack:
                Border(0, 0, 0);
                break;

            case kKeyWhite:
                Border(255, 255, 255);
                break;

            case kKeyCheckerboard:
                check_box();
                break;

            case kKeyHorizontalRamp:
                vertical_gradation();
                break;

            case kKeyVerticalRamp:
                horizontal_gradation();
                break;

            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyOff == my_kvs[0].value) {
            off_testpattern();
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
            return;
        }
    } else {
        IAddFeedbackStrTo(pAt_feedback_str, "Status:%s\n", get_test_pattern());
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
}

IAtOperationRegister(kCmdTemperature, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyNtcBlue:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature[blue_sensor].temperature / 10);
                break;
            case kKeyNtcRed:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature[red_sensor].temperature / 10);
                break;
            case kKeyNtcGreen:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature[green_sensor].temperature / 10);
                break;
            case kKeyNtcLcos:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature[lcos_sensor].temperature / 10);
                break;
            case kKeyNtcEnv:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature[evn_sensor].temperature / 10);
                break;
            case kKeyI2cBlue:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature_i2c[blue_sensor].temperature / 10);
                break;
            case kKeyI2cRed:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature_i2c[red_sensor].temperature / 10);
                break;
            case kKeyI2cGreen:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature_i2c[green_sensor].temperature / 10);
                break;
            case kKeyI2cLcos:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature_i2c[lcos_sensor].temperature / 10);
                break;
            case kKeyI2cEnv:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)temperature_i2c[evn_sensor].temperature / 10);
                break;
            case kKeyRegLcos:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%.1f\n", pAt_Kv_List->pList[i].key.pData, (float)get_rdp250h_register_temperature());
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
    }
    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
}

IAtOperationRegister(kCmdCwSpeed, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[1];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        // IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
        extern int target_speed;
        if (kKeyScatteringWheel == my_kvs[0].key) {
            sscanf(my_kvs[0].value, "%d", &target_speed);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    } else {
        if (kKeyScatteringWheel == my_kvs[0].key) {
            IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n", pAt_Kv_List->pList[0].key.pData, Get_fan_timer_FG(&cw_wheel_fg) * 30);
        } else
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    }
}

IAtOperationRegister(kCmdReset, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyFactory == my_kvs[0].value) {
            clear_sig(sys_sig, sig_lightsource);
            clear_sig(sys_sig, sig_system);
            file_remove_all(&eeprom_log);
            eeprom.light_source_time = 0;
            eeprom_block_write(&BL24C64A, &eeprom_mem[idx_light_source_time], true);
            set_sig(sys_sig, sig_lightsource, true);
            set_sig(sys_sig, sig_system, true);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyUser == my_kvs[0].value) {
            // TODO: add user reset.
            /* 屏蔽打印信息 */
            extern void my_console_logger(ulog_level_t severity, char* msg);
            ULOG_SUBSCRIBE(my_console_logger, ULOG_CRITICAL_LEVEL);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        }
    } else {
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
    }
}

IAtOperationRegister(kCmdError, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[1];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    } else {
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
    }
}

IAtOperationRegister(kCmdLogInfo, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Int my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueInt, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyClear == my_kvs[0].key) {
            file_remove_all(&eeprom_log);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
        }
    } else {
        if (kKeyStatus == my_kvs[0].key) {
            line_t line_tmp[32] = { 0 };
            int read_number = my_kvs[0].value > sizeof(line_tmp) ? sizeof(line_tmp) : my_kvs[0].value;
            int feedback_number = file_burst_read(&eeprom_log, line_tmp, read_number);
            /* Text:%s include '\n' */
            if (feedback_number != 0) {
                for (int i = 0; i < feedback_number; i++) {
                    output_printf("AT+LogInfo#Time:%.2d-%02d-%02d,Text:%s", line_tmp[i].time / 60 / 60, (line_tmp[i].time / 60) % 60, line_tmp[i].time % 60, line_tmp[i].text);
                    debug_printf("AT+LogInfo#Time:%.2d-%02d-%02d,Text:%s", line_tmp[i].time / 60 / 60, (line_tmp[i].time / 60) % 60, line_tmp[i].time % 60, line_tmp[i].text);
                }
            } else {
                output_printf("AT+LogInfo#Time:%.2d-%02d-%02d,Text:%s", 0, 0, 0, "Null");
                debug_printf("AT+LogInfo#Time:%.2d-%02d-%02d,Text:%s", 0, 0, 0, "Null");
            }
        }
    }
}

IAtOperationRegister(kCmdCurrent, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        int current;

