wwhRyan/GD32-F30x/BoardApp/LcosBoard/at.c
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyR:
                sscanf(my_kvs[i].value, "%d", &current);
                // check current
                eeprom.red = (float)current / 100;
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_red], true);
                break;
            case kKeyG:
                sscanf(my_kvs[i].value, "%d", &current);
                // check current
                eeprom.green = (float)current / 100;
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_green], true);
                break;
            case kKeyB:
                sscanf(my_kvs[i].value, "%d", &current);
                // check current
                eeprom.blue = (float)current / 100;
                eeprom_block_write(&BL24C64A, (const mem_t*)&eeprom_mem[idx_blue], true);

                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
        IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyR:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n",
                    pAt_Kv_List->pList[i].key.pData, (int)(eeprom.red * 100));
                break;
            case kKeyG:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n",
                    pAt_Kv_List->pList[i].key.pData, (int)(eeprom.green * 100));
                break;
            case kKeyB:
                IAddKeyValueStrTo(pAt_feedback_str, "%s:%d\n",
                    pAt_Kv_List->pList[i].key.pData, (int)(eeprom.blue * 100));
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }
    }
}

IAtOperationRegister(kCmdSpiFlash, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    size_t addr, at_crc, size = 0;
    uint8_t buff[256] = { 0 };
    char string[512 + 1] = { 0 };
    int ret = 0;
    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeyCrc:
                ret = sscanf(my_kvs[i].value, "%X", &at_crc);
                ULOG_TRACE("at_crc: %#x\n", at_crc);
                break;
            case kKeyData:
                ret = sscanf(my_kvs[i].value, "%512s", string);
                if (512 != strlen(my_kvs[i].value))
                    goto SPIFLASH_VALUE_ERROR;
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto SPIFLASH_VALUE_ERROR;
        }
        if (false == AsciiToInt(string, buff, 1))
            goto SPIFLASH_VALUE_ERROR;

        if (at_crc != get_MSB_array_crc(buff, sizeof(buff)))
            goto SPIFLASH_VALUE_ERROR;

        set_sig(sys_sig, sig_update_rdc200a, true);
        if (0 != rtiVC_ProgramFLASH(addr, buff, 256)) {
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
            clear_sig(sys_sig, sig_update_rdc200a);
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        }
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                if (addr > 0xFFFF)
                    goto SPIFLASH_VALUE_ERROR;
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                if (size > 256)
                    goto SPIFLASH_VALUE_ERROR;
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto SPIFLASH_VALUE_ERROR;
        }

        if (rtiVC_ReadFLASH(addr, buff, size) != 0) {
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        } else {
            IntToAscii(buff, string, 1, size);
            IAddFeedbackStrTo(pAt_feedback_str, "Data:%s\n", string);
        }
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
    return;
SPIFLASH_VALUE_ERROR:
    clear_sig(sys_sig, sig_update_rdc200a);
    IAddFeedbackStrTo(pAt_feedback_str, "InvalidValue\n");
}

IAtOperationRegister(kCmdSpiFlashErase, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);
    size_t addr, size = 0;
    int ret = 0;
    if (kAtControlType == IGetAtCmdType(&at_obj)) {

        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0) {
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
        }

        if (spi_flash_erase(addr, size) == true)
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        else {
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        }
    } else {
        IAddFeedbackStrTo(pAt_feedback_str, "InvalidOperator\n");
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
}

IAtOperationRegister(kCmdRdc200a, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    size_t size = 0;
    size_t addr = 0;
    char string[512 + 1] = { 0 };
    uint8_t data[256] = { 0 };
    int ret;

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            case kKeyData:
                ret = sscanf(my_kvs[i].value, "%512s", string);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto RDC200A_VALUE_ERROR;
        }
        if (size > 256)
            goto RDC200A_VALUE_ERROR;

        if (AsciiToInt(string, data, 1) == false)
            goto RDC200A_VALUE_ERROR;

        if (set_reg_block(RDC200A_ADDR, addr, data, size) != true)
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        else
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto RDC200A_VALUE_ERROR;
        }
        if (size > 256)
            goto RDC200A_VALUE_ERROR;

        if (get_reg_block(RDC200A_ADDR, addr, data, size) != true) {
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        } else {
            IntToAscii(data, string, 1, size);
            IAddFeedbackStrTo(pAt_feedback_str, "Data:%s\n", string);
        }
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
    return;
RDC200A_VALUE_ERROR:
    IAddFeedbackStrTo(pAt_feedback_str, "InvalidValue\n");
}

