wwhRyan/GD32-F30x/BoardApp/LcosBoard/at.c
IAtOperationRegister(kCmdRdp250h, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);
    set_sig(sys_sig, sig_raontech_i2c_errno, true);

    size_t size = 0;
    size_t addr = 0;
    char string[512 + 1] = { 0 };
    uint8_t data[256] = { 0 };
    int ret;

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            case kKeyData:
                ret = sscanf(my_kvs[i].value, "%256s", string);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto RDC250H_VALUE_ERROR;
        }
        if (size > 256)
            goto RDC250H_VALUE_ERROR;

        if (AsciiToInt(string, data, 1) == false)
            goto RDC250H_VALUE_ERROR;

        set_panel_reg_block(addr, data, size);
        IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto RDC250H_VALUE_ERROR;
        }
        if (size > 256)
            goto RDC250H_VALUE_ERROR;

        get_panel_reg_block(addr, data, size);
        IntToAscii(data, string, 1, size);
        IAddFeedbackStrTo(pAt_feedback_str, "Data:%s\n", string);
    }

    if (!get_sig(sys_sig, sig_raontech_i2c_errno)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        ULOG_ERROR("RAONTECH I2C error\n");
        return;
    }
    return;
RDC250H_VALUE_ERROR:
    IAddFeedbackStrTo(pAt_feedback_str, "InvalidValue\n");
}

uint8_t eeprom_data[256] = { 0 };
IAtOperationRegister(kCmdEeprom, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Str my_kvs[MAX_KV_COUPLES_NUM];
    ICastAtKvListTo(kAtValueStr, pAt_Kv_List, my_kvs);

    char ascii_buff[512 + 1] = { 0 };
    size_t addr, size = 0;
    int ret = 0;
    mem_t msg = { 0 };

    if (get_sig(sys_sig, sig_eeprom_write)) {
        IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        return;
    }
    memset(eeprom_data, 0, sizeof(eeprom_data));
    if (kAtControlType == IGetAtCmdType(&at_obj)) {

        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            case kKeyData:
                ret = sscanf(my_kvs[i].value, "%512s", ascii_buff);
                break;
            case kKeyClear:
                file_remove_all(&eeprom_log);
                eeprom_block_clear();
                IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto EEPROM_VALUE_ERROR;
        }

        if (size > 256 && size % 4 != 0)
            goto EEPROM_VALUE_ERROR;
        if (addr % 4 != 0)
            goto EEPROM_VALUE_ERROR;

        if (AsciiToInt(ascii_buff, eeprom_data, 1) != true)
            goto EEPROM_VALUE_ERROR;

        set_sig(sys_sig, sig_eeprom_write, true);
        memory_endian_conversion(eeprom_data, size);
        msg.idx = idx_eeprom_write;
        msg.addr = addr;
        msg.size = size;
        msg.pData = eeprom_data;

        if (eeprom_block_write(&BL24C64A, (const mem_t*)&msg, true))
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        else
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");

    } else {
        for (size_t i = 0; i < pAt_Kv_List->size; i++) {
            switch (my_kvs[i].key) {
            case kKeyAddr:
                ret = sscanf(my_kvs[i].value, "%X", &addr);
                break;
            case kKeySize:
                ret = sscanf(my_kvs[i].value, "%X", &size);
                break;
            default:
                IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
                return;
            }
            if (ret == EOF || ret == 0)
                goto EEPROM_VALUE_ERROR;
        }
        if (size > 256 && size % 4 != 0)
            goto EEPROM_VALUE_ERROR;
        if (addr % 4 != 0)
            goto EEPROM_VALUE_ERROR;

        memset(eeprom_data, 0, sizeof(eeprom_data));
        if (true == i2c_muti_read(&BL24C64A, addr, (uint8_t*)eeprom_data, size)) {
            memory_endian_conversion(eeprom_data, size);
            IntToAscii(eeprom_data, ascii_buff, 1, size);
            IAddFeedbackStrTo(pAt_feedback_str, "Data:%s\n", ascii_buff);
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "ExecuteFailed\n");
        }
    }
    return;
EEPROM_VALUE_ERROR:
    IAddFeedbackStrTo(pAt_feedback_str, "InvalidValue\n");
}

IAtOperationRegister(kCmdSilentAsyncMessages, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyOn == my_kvs[0].value) {
            set_sig(sys_sig, sig_slient_async_msg, true);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyOff == my_kvs[0].value) {
            set_sig(sys_sig, sig_slient_async_msg, false);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
        }
    } else {
        if (get_sig(sys_sig, sig_slient_async_msg) == true) {
            IAddFeedbackStrTo(pAt_feedback_str, "Status:On\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "Status:Off\n");
        }
    }
}

IAtOperationRegister(kCmdFlashBootb, pAt_Kv_List, pAt_feedback_str)
{
    asAtKvUnit_Enum my_kvs[1];
    ICastAtKvListTo(kAtValueEnum, pAt_Kv_List, my_kvs);

    if (kAtControlType == IGetAtCmdType(&at_obj)) {
        if (kKeyOn == my_kvs[0].value) {
            gpio_bit_set(RDC200A_BOOTB_IN_PORT, RDC200A_BOOTB_IN_PIN);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else if (kKeyOff == my_kvs[0].value) {
            gpio_bit_reset(RDC200A_BOOTB_IN_PORT, RDC200A_BOOTB_IN_PIN);
            IAddFeedbackStrTo(pAt_feedback_str, "Ok\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
        }
    } else {
        if (kKeyStatus == my_kvs[0].value) {
            if (SET == gpio_output_bit_get(RDC200A_BOOTB_IN_PORT, RDC200A_BOOTB_IN_PIN))
                IAddFeedbackStrTo(pAt_feedback_str, "Status:On\n");
            else
                IAddFeedbackStrTo(pAt_feedback_str, "Status:Off\n");
        } else {
            IAddFeedbackStrTo(pAt_feedback_str, "InvalidKey\n");
        }
    }
}
